src/toir_cfe/src/Documents/проф_СписаниеТМЦНеТребуется/проф_СписаниеТМЦНеТребуется.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ca4e2695-9435-4dc8-bc67-1e1b083768a6">
  <name>проф_СписаниеТМЦНеТребуется</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9d832bb0-64b9-49b8-b5dd-465b88c7685a">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3adb3e12-f1c0-44a0-9e2d-3d7cc811d060">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="729eb4a4-ca85-43aa-be62-5d2115baea8a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0b3df086-16ce-4fc2-8914-c13393e2afa0">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="810fda09-bdf9-4eb2-93e2-0828822e19e5">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ff0dc43-64c3-4d91-8f22-e53abc933783">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6ae04480-96d0-4b42-a38a-77468b8202a6">
  <name>проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="08ca1fe2-22ec-4b93-a944-e923fd69ea51">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b0a906f0-c1ef-48b1-9e3c-1419f3d9e085">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cf269c73-3461-41b0-b4ca-c1d0165d64a0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="94b5fc89-114f-4c0b-bbfc-774d7d18f1fb">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/проф_СписаниеТМЦНеТребуется/ObjectModule.bsl
//++ Проф-ИТ, #329, Соловьев А.А., 07.11.2023

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЭтоНовый()
		И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.проф_СписаниеТМЦНеТребуется.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Отразитьпроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура проф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура проф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина Тогда
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Дата = ТекущаяДатаСеанса();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура Отразитьпроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт(ДополнительныеСвойства, Движения, Отказ)
	
	Таблицапроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт = ДополнительныеСвойства.ТаблицыДляДвижений.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт;
	
	Если Отказ ИЛИ Таблицапроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движенияпроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт = Движения.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт;
	Движенияпроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Записывать = Истина;
	Движенияпроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Загрузить(Таблицапроф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт);
	
КонецПроцедуры

#КонецОбласти

//-- Проф-ИТ, #329, Соловьев А.А., 07.11.2023
